#include <assert.h>
#include "cbs_target.h"
#include "cbs_scsi.h"

/**
 * Sense Context Table. Sense codes are SCSI error codes and a sense
 * context is shorthand for an error that occurs in the RAID. The SCSI Sense
 * codes are generated by a simple lookup of a sense context. This is
 * easier than generating SCSI sense codes because many similar operations
 * generate the same codes. If we want to change this behaviour we have to 
 * change the code in one place - here.
 */
typedef struct sense_tuple
{
    uint8 key;
    uint16 asc;
}sense_tuple_t;

static sense_tuple_t sense_ctx_tbl[nb_sense_contexts] = {
    /** SENSE_CTX_NONE             */{ KEY_NO_SENSE, ASC_NO_ADDT_SENSE_INFO         },
    /** SENSE_CTX_TASK_FULL        */{ KEY_NO_SENSE, ASC_NO_ADDT_SENSE_INFO },
    /** SENSE_CTX_ILLEGAL_CDB      */{ KEY_ILLEGAL_REQUEST, ASC_INVALID_FIELD_IN_CDB },
    /** SENSE_CTX_NOT_READY        */{ KEY_NOT_READY, ASC_LUN_NR_BECOMING_RDY },
    /** SENSE_CTX_HARDWARE_ERR     */{ KEY_HARDWARE_ERROR, ASC_INTERNAL_TARGET_ERR },
    /** SENSE_CTX_WRITE_PROTECT    */{ KEY_DATA_PROTECT, ASC_WR_PROTECTED },
    /** SENSE_CTX_LUN_UNSUPPORTED  */{ KEY_ILLEGAL_REQUEST, ASC_LUN_UNSUPPORTED },
    /** SENSE_CTX_RESERVE_CONF     */{ KEY_NO_SENSE, ASC_NO_ADDT_SENSE_INFO },
    /** SENSE_CTX_RESET_POWER_ON   */{ KEY_UNIT_ATTENTION, ASC_POWER_ON_RESET },
    /** SENSE_CTX_RESET_DIRECTED   */{ KEY_UNIT_ATTENTION, ASC_BUS_DEVICE_RESET },
    /** SENSE_CTX_MEDIUM_ERR_RD    */{ KEY_MEDIUM_ERROR, ASC_RD_ERR },
    /** SENSE_CTX_MEDIUM_ERR_WR    */{ KEY_MEDIUM_ERROR, ASC_WR_ERR },
    /** SENSE_CTX_MEDIUM_ERR_AMNF  */{ KEY_MEDIUM_ERROR, ASC_ADDR_MARK_NOT_FOUND },
    /** SENSE_CTX_TASK_SET_CLEARED */{ KEY_UNIT_ATTENTION, ASC_TAG_CMD_CLRD_BY_OTHER_INIT },
    /** SENSE_CTX_VOL_OVERFLOW     */{ KEY_VOLUME_OVERFLOW, ASC_LOGICAL_BLOCK_OUT_OF_RANGE },
    /** SENSE_CTX_FC_ERR           */{ KEY_ABORTED_COMMAND, ASC_SCSI_BUS_PARITY_ERR },
    /** SENSE_CTX_SCSI_PARITY_ERR  */{ KEY_ABORTED_COMMAND, ASC_SCSI_BUS_PARITY_ERR },
    /** SENSE_CTX_SCSI_DATA_ERR    */{ KEY_ABORTED_COMMAND, ASC_SCSI_DATA_PHASE_CRC_ERR },
    /** SENSE_CTX_SCSI_ST_ERR      */{ KEY_ABORTED_COMMAND, ASC_SCSI_ST_DATA_PHASE_CRC_ERR },
    /** SENSE_CTX_SCSI_IU_ERR      */{ KEY_ABORTED_COMMAND, ASC_SCSI_IU_PHASE_CRC_ERR },
    /** SENSE_CTX_MSG_RJT_ERR      */{ KEY_ABORTED_COMMAND, ASC_MSG_RJT_ERR },
    /** SENSE_CTX_INITIATOR_ERR    */{ KEY_ABORTED_COMMAND, ASC_INITIATOR_DETECTED_ERR },
    /** SENSE_CTX_RESERVES_PREEMPTED*/{ KEY_UNIT_ATTENTION, ASC_RESERVATIONS_PREEMPTED },
    /** SENSE_CTX_DOWNLOAD_FAILED   */{ KEY_HARDWARE_ERROR, ASC_CHECKSUM_ERROR_ON_DOWNLOAD },
    /** SENSE_CTX_INSUFF_REG_RESOURC*/{ KEY_ILLEGAL_REQUEST, ASC_INSUFFICIENT_REGISTRATION_RESOURCES },
    /** SENSE_CTX_PARAM_LIST_LEN_ERR*/{ KEY_ILLEGAL_REQUEST, ASC_PARAM_LIST_LEN_ERR },
    /** SENSE_CTX_INVALID REL _OF_PR*/{ KEY_ILLEGAL_REQUEST, ASC_INVALD_RELEASE_OF_PR },
    /** SENSE_CTX_IFP_IN_PARAM_LIST */{ KEY_ILLEGAL_REQUEST, ASC_IFP_IN_PARAM_LIST },
    /** SENSE_CTX_TP_IN_TRANSIT   */{ KEY_NOT_READY, ASC_LUN_NA_TP_IN_TRANSIT },
    /** SENSE_CTX_TP_IN_STANDY      */{ KEY_NOT_READY, ASC_LUN_NA_TP_IN_STANDBY },
    /**SENSE_CTX_TP_IN_UNAVAILABLE  */{ KEY_NOT_READY, ASC_LUN_NA_TP_IN_UNAVAILABLE },

    /** SENSE_CTX_INTERNAL_REBUILD_FAILED */{ KEY_ABORTED_COMMAND, ASC_RT_INTERNAL_REBUILD_STRIPE_FAILED },
    /** SENSE_CTX_INTERNAL_CMD_FAILED     */{ KEY_ABORTED_COMMAND, ASC_RT_INTERNAL_CMD_FAILED },
    /** SENSE_CTX_INTERNAL_XFER_FAILED    */{ KEY_ABORTED_COMMAND, ASC_RT_INTERNAL_XFER_FAILED },
    /** SENSE_CTX_INTERNAL_RESOURCE_FAILED*/{ KEY_ABORTED_COMMAND, ASC_RT_INTERNAL_RESOURCE_FAILED },
    /** SENSE_CTX_INTERNAL_WRONG_PARAM    */{ KEY_ABORTED_COMMAND, ASC_RT_INTERNAL_WRONG_PARAM },
    /** SENSE_CTX_INTERNAL_LINK_DOWN      */{ KEY_ABORTED_COMMAND, ASC_RT_INTERNAL_LINK_DOWN },
    /** SENSE_CTX_INTERNAL_DEVICE_GONE    */{ KEY_ABORTED_COMMAND, ASC_RT_INTERNAL_DEVICE_GONE }
};

typedef struct scsi_inquiry_vpd_unit_serial {
    uint8 type;
    uint8 page;   /* 0x80 */
    uint8 rsvd;    /* 0x0 */
    uint8 length;  /* 0x8 */
    uint8 serial[20];
}scsi_inquiry_vpd_unit_serial_t;

typedef struct scsi_inquiry_vpd_wwn {
    uint8 type;
    uint8 page;    /* 0x83 */
    uint8 rsvd;    /* 0x00 */
    uint8 length;  /* 0x0c */
    uint8 code_set;
    uint8 assoc_idtype;
    uint8 reserved;
    uint8 id_len; /* 0x08 */
    uint8 id[8];
}scsi_inquiry_vpd_wwn_t;

typedef struct scsi_inquiry_firmware {
    uint8 type;
    uint8 page;    /* 0xC0 */
    uint8 rsvd;    /* 0x00 */
    uint8 length;  /* 0x08 */
    uint8 release_num[8];
}scsi_inquiry_firmware_t;

typedef struct scsi_inquiry_info {
    uint8 type;                     //0
    uint8 modifier;                 //1
    uint8 version;                  //2
    uint8 rdf;                      //3
    uint8 length;                   //4
    uint8 rsvd;                     //5
    uint8 port_info;                //6
    uint8 bits;                     //7
    uint8 vendor_id[8];             //8
    uint8 prod_id[16];              //16
    uint8 rev_id[4];                //32
    uint8 serial[20];               //36
    uint8 clocking;                 //56
    uint8 rsvd1;                    //57
    uint8 version_descs[16];        //58
    uint8 resvd2[21];               //74
    uint8 vendor_spec[4];           //95
    uint8 resvd3;                   // 99
}scsi_inquiry_info_t;

typedef struct scsi_inquiry_vpd_list {
    uint8 type;
    uint8 page;   /* 0x80 */
    uint8 rsvd;    /* 0x0 */
    uint8 length;  /* 0x8 */
    uint8 supported_pages[16];
}scsi_inquiry_vpd_list_t;

typedef struct scsi_mode_page2 {
    uint8 page;                 /* 0x82 */
    uint8 len;                  /* 0x0e */
    uint8 buffer_full;          /* 0x80 */
    uint8 buffer_empty;         /* 0x80 */
    uint8 buffer_inact_msb;     /* 0x00 */
    uint8 buffer_inact_lsb;     /* 0x0a */
    uint16 disconn_time_limit;  /* 0x0000 */
    uint16 conn_time_limit;     /* 0x0000 */
    uint16 max_burst_size;      /* 0x0000 */
    uint8 diss_bits;            /* 0x0 */
    uint8 reserved1;            /* 0x0 */
    uint16 first_burst_size;     /* 0x0 */
}scsi_mode_page2_t;

/**
 * Format Parameters Mode Page
 */

typedef struct scsi_mode_page3{
    uint8 page;                 /* 0x83 */
    uint8 len;                  /* 0x16 */
    uint16 tracks_per_zone;     /* 0x0015 */
    uint16 alt_sect_per_zone;   /* 0x0009 */
    uint16 alt_trks_per_zone;   /* 0x0000 */
    uint16 alt_trks_per_vol;    /* 0x0015 */
    uint16 sectors_per_track;   /* 0x0080 */
    uint16 bytes_per_sector;    /* 0x0200 */
    uint16 interleave;          /* 0x0001 */
    uint16 track_skew;          /* 0x0009 */
    uint16 cylinder_skew;       /* 0x0010 */
    uint8 bits;                 /* 0x04 */
    uint8 reserved1;            /* 0x0 */
    uint8 reserved2;            /* 0x0 */
    uint8 reserved3;            /* 0x0 */
}scsi_mode_page3_t;

/**
 * Disk Geometry Mode page
 */
typedef struct scsi_mode_page4{
    uint8 page;                 /* 0x84 */
    uint8 len;                  /* 0x16 */
    uint8 num_cylinders_msb;    /* 0x00 */
    uint8 num_cylinders;        /* 0x0e */
    uint8 num_cylinders_lsb;    /* 0x80 */
    uint8 num_heads;            /* 0x20 */
    uint8 start_cyl_wrt_pre0;   /* 0x00 */
    uint8 start_cyl_wrt_pre1;   /* 0x00 */
    uint8 start_cyl_wrt_pre2;   /* 0x00 */
    uint8 start_cyl_red_wrt0;   /* 0x00 */
    uint8 start_cyl_red_wrt1;   /* 0x00 */
    uint8 start_cyl_red_wrt2;   /* 0x00 */
    uint8 drive_step_rate0;     /* 0x0000 */
    uint8 drive_step_rate1;     /* 0x0000 */
    uint8 landing_zone0;        /* 0x0000 */
    uint8 landing_zone1;        /* 0x0000 */
    uint8 landing_zone2;        /* 0x0000 */
    uint8 rpl;                  /* 0x00 */
    uint8 rotational_offset;    /* 0x00 */
    uint8 reserved1;            /* 0x00 */
    uint16 medium_rot_rate;     /* 0x1c20 */
    uint8 reserved2;            /* 0x0 */
    uint8 reserved3;            /* 0x0 */
}scsi_mode_page4_t;

/**
 * Caching Parameters Page
 */
typedef struct scsi_mode_page8{
    uint8 page;                 /* 0x84 */
    uint8 len;                  /* 0x12 */
    uint8 bits;                 /* 0x14 */
    uint8 retention_prio;       /* 0x00 */
    uint16 dis_pref_xfer_len;   /* 0xffff */
    uint16 minimum_prefetch;    /* 0x0000 */
    uint16 max_prefetch;        /* 0x009f */
    uint16 max_pref_ceiling;    /* 0x027c */
    uint8 fsw_lbcss_dra;        /* 0x80 */
    uint8 num_cache_segs;       /* 0x03 */
    uint16 cache_seg_size;      /* 0x0000 */
    uint8 reserved;             /* 0x00 */
    uint8 non_cache_seg0;       /* 0x00 */
    uint8 non_cache_seg1;       /* 0x00 */
    uint8 non_cache_seg2;       /* 0x00 */
}scsi_mode_page8_t;

/**
 * Mode Sense/Select Control Page
 */
typedef struct scsi_mode_pageA{
    uint8 page;                 /* 0x8a */
    uint8 len;                  /* 0x0a */
    uint8 bits;                 /* 0x02 */
    uint8 queue_bits;           /* 0x10 */
    uint8 rac_swp;              /* 0x00 */
    uint8 autoload_mode;            /* 0x00 */ //changed from reserved to auto
    uint16 unsupp;              /* 0x0000 */
    uint16 busy_timeout;        /* 0x0000 */
    uint16 st_completion_time;   /* 0x00 */   //changed from reserved to..
}scsi_mode_pageA_t;

/**
 * Informational Exceptions Page
 */
typedef struct scsi_mode_page1C{
    uint8 page;                 /* 0x9c */
    uint8 len;                  /* 0x0a */
    uint8 bits;                 /* 0x00 */
    uint8 mrie;                 /* 0x00 */
    uint32 interval_timer;      /* 0x00000000 */
    uint32 report_count;        /* 0x00000000 */
}scsi_mode_page1C_t;

static CTargetPool g_target_pool;

CTarget* get_target_by_class_id(uint32 class_id)
{
    return g_target_pool.get_target_by_class_id(class_id);
}

CTarget* get_target_by_device_no(uint32 device_no)
{
    CDevice *p_dev = get_device_by_index(device_no);
    return get_target_by_class_id(p_dev->get_class_id());
}

void target_ReplyGood(cbs_buf_t *p_cbuf)
{
    get_target_by_device_no(p_cbuf->device_no)->reply_good(p_cbuf);
}

void target_ReplyNoDevice(cbs_buf_t *p_cbuf)
{
    get_target_by_device_no(p_cbuf->device_no)->reply_nodevice(p_cbuf);
}

void target_ReplyCmdAborted(cbs_buf_t *p_cbuf)
{
    get_target_by_device_no(p_cbuf->device_no)->reply_cmd_aborted(p_cbuf);
}

void target_ReplyCmdDoneWithError(cbs_buf_t *p_cbuf, uint32 sense)
{
